
&НаКлиенте
Процедура ПереченьНоменклатурыПриАктивизацииСтроки(Элемент)
	ПереченьНоменклатурыПриАктивищацииСтрокиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПереченьНоменклатурыПриАктивищацииСтрокиНаСервере()
	// Здесь могла быть ваша реклама, но я выполняю этот курс бесплатно в новогодние праздники...
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	// Пересчитать сумму строки.
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры