Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	Сообщить("ПриОтправкеДанныхГлавному " + ЭлементДанных);
КонецПроцедуры

Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента)
	Сообщить("ПриОтправкеДанныхПодчиненному " + ЭлементДанных);
КонецПроцедуры

Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	Сообщить("ПриПолученииДанныхОтГлавного " + ЭлементДанных);
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	Сообщить("ПриПолученииДанныхОтПодчиненного " + ЭлементДанных);
КонецПроцедуры